Revit 2027 API
AnalysisDisplayMarkersAndTextSettings.MarkerType Property
 Type of marker.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public AnalysisDisplayStyleMarkerType MarkerType { get; set; }
Public Property MarkerType As AnalysisDisplayStyleMarkerType
	Get
	Set
public:
property AnalysisDisplayStyleMarkerType MarkerType {
	AnalysisDisplayStyleMarkerType get ();
	void set (AnalysisDisplayStyleMarkerType value);
}
member MarkerType : AnalysisDisplayStyleMarkerType with get, set
Property Value
AnalysisDisplayStyleMarkerType
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
AnalysisDisplayMarkersAndTextSettings Class
Autodesk.Revit.DB.Analysis Namespace